import React from 'react';
import CommonPageLayout from '../CommonPageLayout';

const DisclaimerPage = () => {
  return (
    <CommonPageLayout title="免責事項">
      <p className="b1z9x_paragraph">本ウェブサイト「BANMA」（以下「本サイト」といいます）に掲載されている情報は、細心の注意を払い、可能な限り正確な情報を提供するよう努めておりますが、その内容の正確性、完全性、最新性、および利用者の特定の目的への適合性について、明示または暗示を問わず、いかなる保証も行うものではありません。</p>

      <p className="b1z9x_paragraph">本サイトの利用、または本サイトに掲載されている情報に基づいて行われた行動の結果として利用者に生じた直接的または間接的な損害について、本サイトは一切の責任を負わないものとします。これには、データの損失、業務の中断、逸失利益、およびその他あらゆる種類の損害が含まれますが、これらに限定されません。</p>

      <p className="b1z9x_paragraph">本サイトからリンクされている第三者のウェブサイトの内容、安全性、プライバシーポリシー等について、本サイトは一切の責任を負いません。これらのリンクは利用者の便宜のために提供されているものであり、リンク先のウェブサイトの内容を推奨または保証するものではありません。利用者は、これらのリンク先のウェブサイトを利用する際には、それぞれの利用規約やプライバシーポリシー等を確認し、自己の責任において判断してください。</p>

      <p className="b1z9x_paragraph">本サイトに掲載されている情報は、予告なしに変更、修正、削除されることがあります。本サイトは、これらの変更等によって生じたいかなる損害についても責任を負うものではありません。</p>

      <p className="b1z9x_paragraph">本サイトに掲載されているコンテンツに関する著作権は、本サイトまたは正当な権利を有する第三者に帰属します。無断での複製、転載、改変、頒布等の行為は固く禁止いたします。</p>

      <p className="b1z9x_paragraph">本免責事項は、適用される法令の範囲内で最大限に有効となるものとします。</p>

      <p className="b1z9x_paragraph">最終更新日：2025年5月1日</p>
    </CommonPageLayout>
  );
};

export default DisclaimerPage;